In [1]:
# E-Commerce Sales Data Analysis using Python
#This project analyzes e-commerce sales data to understand sales performance, product trends, and customer behavior using Python.


import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

plt.style.use("default")

In [3]:
orders = pd.read_csv(r"C:\Users\piyus\Desktop\Ecommerce PowerBi project\Orders.csv")
details = pd.read_csv(r"C:\Users\piyus\Desktop\Ecommerce PowerBi project\Details.csv")

In [5]:
orders.head()

  Order ID  Order Date CustomerName           State     City
0  B-26055  10-03-2018    Harivansh   Uttar Pradesh  Mathura
1  B-25993  03-02-2018       Madhav           Delhi    Delhi
2  B-25973  24-01-2018  Madan Mohan   Uttar Pradesh  Mathura
3  B-25923  27-12-2018        Gopal     Maharashtra   Mumbai
4  B-25757  21-08-2018     Vishakha  Madhya Pradesh   Indore

In [9]:
details.head()

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card

In [11]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      500 non-null    object
 1   Order Date    500 non-null    object
 2   CustomerName  500 non-null    object
 3   State         500 non-null    object
 4   City          500 non-null    object
dtypes: object(5)
memory usage: 19.7+ KB

In [13]:
details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      1500 non-null   object
 1   Amount        1500 non-null   int64
 2   Profit        1500 non-null   int64
 3   Quantity      1500 non-null   int64
 4   Category      1500 non-null   object
 5   Sub-Category  1500 non-null   object
 6   PaymentMode   1500 non-null   object
dtypes: int64(3), object(4)
memory usage: 82.2+ KB

In [15]:
orders.isnull().sum()

Order ID        0
Order Date      0
CustomerName    0
State           0
City            0
dtype: int64

In [17]:
details.isnull().sum()

Order ID        0
Amount          0
Profit          0
Quantity        0
Category        0
Sub-Category    0
PaymentMode     0
dtype: int64

In [19]:
# Remove duplicate rows
orders.drop_duplicates(inplace=True)
details.drop_duplicates(inplace=True)

# Fill missing values (basic handling)
orders.fillna(method='ffill', inplace=True)
details.fillna(0, inplace=True)

C:\Users\piyus\AppData\Local\Temp\ipykernel_41440\3773701798.py:6: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  orders.fillna(method='ffill', inplace=True)

In [21]:
df = pd.merge(orders, details, on='Order ID', how='inner')
df.head()

,Order ID,Order Date,CustomerName,State,City,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,5729,64,14,Furniture,Chairs,EMI
1,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,671,114,9,Electronics,Phones,Credit Card
2,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,443,11,1,Clothing,Saree,COD
3,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,57,7,2,Clothing,Shirt,UPI
4,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,227,48,5,Clothing,Stole,COD

In [53]:
df['Order Date'] = pd.to_datetime(df['Order Date'], format='%d-%m-%Y')

In [27]:
df['Order_Year'] = df['Order Date'].dt.year
df['Order_Month'] = df['Order Date'].dt.month
df['Order_Month_Name'] = df['Order Date'].dt.month_name()
df['Order_Day'] = df['Order Date'].dt.day
df['Order_Weekday'] = df['Order Date'].dt.day_name()

In [29]:
# Average selling price per unit
df['Price_per_Unit'] = df['Amount'] / df['Quantity']

# Profit margin percentage
df['Profit_Margin_%'] = (df['Profit'] / df['Amount']) * 100

In [31]:
def order_size(qty):
    if qty <= 2:
        return 'Small'
    elif qty <= 5:
        return 'Medium'
    else:
        return 'Large'

df['Order_Size'] = df['Quantity'].apply(order_size)

In [33]:
avg_amount = df['Amount'].mean()

df['High_Value_Order'] = df['Amount'].apply(
    lambda x: 'High' if x > avg_amount else 'Low'
)

In [35]:
avg_amount = df['Amount'].mean()

df['High_Value_Order'] = df['Amount'].apply(
    lambda x: 'High' if x > avg_amount else 'Low'
)

In [37]:
# Total spend by customer
df['Customer_Total_Spend'] = df.groupby('CustomerName')['Amount'].transform('sum')

# Total orders by customer
df['Customer_Order_Count'] = df.groupby('CustomerName')['Order ID'].transform('nunique')

In [39]:
df['State_Total_Sales'] = df.groupby('State')['Amount'].transform('sum')
df['City_Total_Sales'] = df.groupby('City')['Amount'].transform('sum')

In [41]:
df['Online_Payment'] = df['PaymentMode'].apply(
    lambda x: 'Yes' if x in ['Credit Card', 'UPI', 'Debit Card'] else 'No'
)

In [51]:
df.head()

,Order ID,Order Date,CustomerName,State,City,Amount,Profit,Quantity,Category,Sub-Category,...,Order_Weekday,Price_per_Unit,Profit_Margin_%,Order_Size,High_Value_Order,Customer_Total_Spend,Customer_Order_Count,State_Total_Sales,City_Total_Sales,Online_Payment
0,B-26055,2018-03-10,Harivansh,Uttar Pradesh,Mathura,5729,64,14,Furniture,Chairs,...,Saturday,409.214286,1.117123,Large,High,9902,1,38362,28747,No
1,B-26055,2018-03-10,Harivansh,Uttar Pradesh,Mathura,671,114,9,Electronics,Phones,...,Saturday,74.555556,16.989568,Large,High,9902,1,38362,28747,Yes
2,B-26055,2018-03-10,Harivansh,Uttar Pradesh,Mathura,443,11,1,Clothing,Saree,...,Saturday,443.000000,2.483070,Small,High,9902,1,38362,28747,No
3,B-26055,2018-03-10,Harivansh,Uttar Pradesh,Mathura,57,7,2,Clothing,Shirt,...,Saturday,28.500000,12.280702,Small,Low,9902,1,38362,28747,Yes
4,B-26055,2018-03-10,Harivansh,Uttar Pradesh,Mathura,227,48,5,Clothing,Stole,...,Saturday,45.400000,21.145374,Medium,Low,9902,1,38362,28747,No

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 25 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Order ID              1500 non-null   object
 1   Order Date            1500 non-null   datetime64[ns]
 2   CustomerName          1500 non-null   object
 3   State                 1500 non-null   object
 4   City                  1500 non-null   object
 5   Amount                1500 non-null   int64
 6   Profit                1500 non-null   int64
 7   Quantity              1500 non-null   int64
 8   Category              1500 non-null   object
 9   Sub-Category          1500 non-null   object
 10  PaymentMode           1500 non-null   object
 11  Order_Year            1500 non-null   int32
 12  Order_Month           1500 non-null   int32
 13  Order_Month_Name      1500 non-null   object
 14  Order_Day             1500 non-null   int32
 15  Order_Weekday         1500 non-null   object
 16  Price_per_Unit        1500 non-null   float64
 17  Profit_Margin_%       1500 non-null   float64
 18  Order_Size            1500 non-null   object
 19  High_Value_Order      1500 non-null   object
 20  Customer_Total_Spend  1500 non-null   int64
 21  Customer_Order_Count  1500 non-null   int64
 22  State_Total_Sales     1500 non-null   int64
 23  City_Total_Sales      1500 non-null   int64
 24  Online_Payment        1500 non-null   object
dtypes: datetime64[ns](1), float64(2), int32(3), int64(7), object(12)
memory usage: 275.5+ KB